# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
# Challenge 1: Data Cleaning and Formatting

# Import pandas library
import pandas as pd

# Read CSV file 1
url = 'customer_df_saved.csv'
customer_df_saved = pd.read_csv(url)

# Read CSV file 2
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv'
customer_df2 = pd.read_csv(url)

# Read CSV file 3
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv'
customer_df3 = pd.read_csv(url)

In [2]:
# customer_df_saved overview

customer_df_saved.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,F,Master,793690,0,1000,0,Personal Auto,Four-Door Car,2
1,QZ44356,Arizona,F,Bachelor,697953,0,94,0,Personal Auto,Four-Door Car,1131
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,0,Personal Auto,Two-Door Car,566
3,WW63253,California,M,Bachelor,764586,0,106,0,Corporate Auto,SUV,529
4,GA49547,Washington,M,High School or Below,536307,36357,68,0,Personal Auto,Four-Door Car,17

In [3]:
# Format column names for customer_df2
customer_df2.columns = customer_df2.columns.str.lower()
customer_df2.columns = customer_df2.columns.str.replace(' ', '_')
customer_df2.rename(columns= {"st" : "state"}, inplace=True)

In [4]:
# Format column names for customer_df3
customer_df3.columns = customer_df3.columns.str.lower()
customer_df3.columns = customer_df3.columns.str.replace(' ', '_')
customer_df3.rename(columns= {"st" : "state"}, inplace=True)

In [5]:
# customer_df2 overview
customer_df2.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [6]:
# customer_df3 overview
customer_df3.head()

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [7]:
# Create a combined DataFrame

customer_df_complete = pd.concat([customer_df_saved, customer_df2, customer_df3], axis=0)
customer_df_complete.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,F,Master,793690,0,1000,0,Personal Auto,Four-Door Car,2.0
1,QZ44356,Arizona,F,Bachelor,697953,0,94,0,Personal Auto,Four-Door Car,1131.0
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,0,Personal Auto,Two-Door Car,566.0
3,WW63253,California,M,Bachelor,764586,0,106,0,Corporate Auto,SUV,529.0
4,GA49547,Washington,M,High School or Below,536307,36357,68,0,Personal Auto,Four-Door Car,17.0

In [8]:
# Show the dimensions of the combined dataframe
customer_df_complete.shape

(9138, 11)

In [16]:
# Check DataFrame info
customer_df_complete.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9138 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9138 non-null   object
 1   state                      9138 non-null   object
 2   gender                     9133 non-null   object
 3   education                  9138 non-null   object
 4   customer_lifetime_value    9134 non-null   object
 5   income                     9138 non-null   int64
 6   monthly_premium_auto       9138 non-null   int64
 7   number_of_open_complaints  9138 non-null   object
 8   policy_type                9138 non-null   object
 9   vehicle_class              9138 non-null   object
 10  total_claim_amount         9138 non-null   int64
dtypes: int64(3), object(8)
memory usage: 856.7+ KB

In [12]:
# Change column types
customer_df_complete['total_claim_amount'] = customer_df_complete['total_claim_amount'].astype(int)

In [15]:
# Check duplicated values
customer_df_complete.duplicated().any()

False

In [14]:
# Check null values
customer_df_complete.isna().any()

customer                     False
state                        False
gender                        True
education                    False
customer_lifetime_value       True
income                       False
monthly_premium_auto         False
number_of_open_complaints    False
policy_type                  False
vehicle_class                False
total_claim_amount           False
dtype: bool

In [17]:
# Check gender values
customer_df_complete['gender'].unique()

array(['F', 'M', nan, 'female', 'Male'], dtype=object)

In [19]:
# Clean gender column
customer_df_complete['gender'].replace('female', 'F', inplace=True)
customer_df_complete['gender'].replace('Male', 'M', inplace=True)
customer_df_complete['gender'].unique()

array(['F', 'M', nan], dtype=object)

In [23]:
# Check education values
customer_df_complete['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       'Bachelors'], dtype=object)

In [25]:
# Clean education column
customer_df_complete['education'].replace('Bachelors', 'Bachelor', inplace=True)
customer_df_complete['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor'],
      dtype=object)

In [28]:
# Check number_of_open_complaints values
customer_df_complete['number_of_open_complaints'].unique()

array([0, 2, 3, 5, 4, '1/0/00', '1/1/00', '1/3/00', '1/5/00', '1/2/00',
       '1/4/00', 1], dtype=object)

In [29]:
# Clean number_of_open_complaints values
# Extract the appropiate number
customer_df_complete['number_of_open_complaints'] = customer_df_complete['number_of_open_complaints'].str.lstrip('1/')
customer_df_complete['number_of_open_complaints'] = customer_df_complete['number_of_open_complaints'].str.rstrip('/00')
customer_df_complete['number_of_open_complaints'].unique()

array([nan, '', '3', '5', '2', '4'], dtype=object)

In [32]:
# Check number_of_open_complaints values
customer_df_complete['total_claim_amount'].unique()

array([   2, 1131,  566, ..., 1329, 1950,  790])

In [33]:
# This is the combined cleaned dataframe
customer_df_complete.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,F,Master,793690,0,1000,NaN,Personal Auto,Four-Door Car,2
1,QZ44356,Arizona,F,Bachelor,697953,0,94,NaN,Personal Auto,Four-Door Car,1131
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,NaN,Personal Auto,Two-Door Car,566
3,WW63253,California,M,Bachelor,764586,0,106,NaN,Corporate Auto,SUV,529
4,GA49547,Washington,M,High School or Below,536307,36357,68,NaN,Personal Auto,Four-Door Car,17

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [34]:
# Challenge 2: Structuring Data

# Read CSV file 
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv'
marketing_df = pd.read_csv(url)

In [39]:
# DataFrame overview
marketing_df.head()

,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,income,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,48029,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,0,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,22139,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,49078,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,23675,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [36]:
marketing_df.shape

(10910, 27)

In [37]:
# Check dataframe info
marketing_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 27 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   unnamed:_0                     10910 non-null  int64
 1   customer                       10910 non-null  object
 2   state                          10910 non-null  object
 3   customer_lifetime_value        10910 non-null  float64
 4   response                       10910 non-null  object
 5   coverage                       10910 non-null  object
 6   education                      10910 non-null  object
 7   effective_to_date              10910 non-null  object
 8   employmentstatus               10910 non-null  object
 9   gender                         10910 non-null  object
 10  income                         10910 non-null  int64
 11  location_code                  10910 non-null  object
 12  marital_status                 10910 non-null  object
 13  monthly_premium_auto           10910 non-null  int64
 14  months_since_last_claim        10910 non-null  float64
 15  months_since_policy_inception  10910 non-null  int64
 16  number_of_open_complaints      10910 non-null  float64
 17  number_of_policies             10910 non-null  int64
 18  policy_type                    10910 non-null  object
 19  policy                         10910 non-null  object
 20  renew_offer_type               10910 non-null  object
 21  sales_channel                  10910 non-null  object
 22  total_claim_amount             10910 non-null  float64
 23  vehicle_class                  10910 non-null  object
 24  vehicle_size                   10910 non-null  object
 25  vehicle_type                   10910 non-null  object
 26  month                          10910 non-null  int64
dtypes: float64(4), int64(6), object(17)
memory usage: 2.2+ MB

In [38]:
# Drop unnamed:_0 column
marketing_df = marketing_df.drop('unnamed:_0', axis=1)

In [76]:
# Saving the dataframe into a CSV file
marketing_df.to_csv('marketing_customer_analysis.csv', index=False)

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [50]:
# Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).

total_revenue_for_sales_channel = pd.pivot_table(marketing_df, values='total_claim_amount', index='sales_channel')
total_revenue_for_sales_channel.head()

               total_claim_amount
sales_channel
Agent                  439.268823
Branch                 430.577100
Call Center            432.788800
Web                    434.563372

In [51]:
# Rename total_claim_amount column
total_revenue_for_sales_channel = total_revenue_for_sales_channel.rename(columns={'total_claim_amount': 'total_revenue'})
total_revenue_for_sales_channel.head()

               total_revenue
sales_channel
Agent             439.268823
Branch            430.577100
Call Center       432.788800
Web               434.563372

In [52]:
# Round the total revenue to 2 decimal points.
total_revenue_for_sales_channel['total_revenue'] = total_revenue_for_sales_channel['total_revenue'].round(2)
total_revenue_for_sales_channel.head()

               total_revenue
sales_channel
Agent                 439.27
Branch                430.58
Call Center           432.79
Web                   434.56

## Analyze the resulting table to draw insights.
### This summary table shows that the sales channel that produces more sales is "Agent", but it is followed very closely by the other channels. Being "Call Center" the next one in line, then "Branch" and finally "Web".
### By looking at this table and the results, we can assume that having an agent is the most effective way in order to gain sales. This tells as that the huma factor is still the most trustful strategy for clients. The call center is also working very well, which makes sense, regarding the digital era we're living right now. But it is also a surprising fact, as many people nowadays don't answer calls and much less if it's a sales company. The branch itself is gathering a lot of sales, which is a sign that the company is strong and its getting new clients the traditional way. And finally, the sales channel with less revenue is the Web, which gives a lot of information and should encourage the marketing company to invest more in their presence in social media and the digital world, as they may be losing young clients because of that. We should activate a strong marketing campaign to reinforce the web presence and start getting clients there, because it should be one of the most powerful sales channel for the company.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [63]:
# Create a pivot table that shows the average customer lifetime value per gender and education level. 

value_per_gender_education = pd.pivot_table(marketing_df, values='customer_lifetime_value', index=['gender', 'education'], aggfunc='mean')
value_per_gender_education.head(10)

                             customer_lifetime_value
gender education
F      Bachelor                          7874.269478
       College                           7748.823325
       Doctor                            7328.508916
       High School or Below              8675.220201
       Master                            8157.053154
M      Bachelor                          7703.601675
       College                           8052.459288
       Doctor                            7415.333638
       High School or Below              8149.687783
       Master                            8168.832659

## Analyze the resulting table to draw insights.

### Regarding this new table that collects the average customer lifetime value of the clients per gender and education, we can draw interesting insights about it.

### First of all, we can compare by genders. By doing this, we realise that both genders have very similar average values, we can't conclude that there's a huge difference between one sex and the other regarding customer lifetime value.

### If we compare the data by education, we can see that clients tend to have more lifetime value when their education is High School or Below, followed by those who have a Master. This means that people with higher level of education tend to have, on average, less lifetime value.

### Comparing both the gender and the level of education, the ones that have more lifetime value on average are women that went to High School. They have a difference of almost 500 with men who went to High School, which shows that there is a gap on gender equality regarding education. This is also present on the clients that have less lifetime value, which are women that are doctored. 

### With this insights, we can assume that men tend to have more lifetime value than women. And that their lifetime value grows when they have less level of education.

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [73]:
# Create a summary table showing the number of complaints by policy type and month. Show it in a long format table.

complaints_by_policy = pd.pivot_table(marketing_df, values='number_of_open_complaints', index=['policy_type', 'month'], aggfunc='count')
complaints_by_policy

                      number_of_open_complaints
policy_type    month
Corporate Auto 1                           1252
               2                           1089
Personal Auto  1                           4329
               2                           3799
Special Auto   1                            237
               2                            204

In [74]:
# Reset the index
complaints_by_policy = complaints_by_policy.reset_index()

In [75]:
# Convert the table to long format
complaints_by_policy_long = complaints_by_policy.melt(id_vars=['policy_type', 'month'], value_name='Number of Complaints')
complaints_by_policy_long

      policy_type  month                   variable  Number of Complaints
0  Corporate Auto      1  number_of_open_complaints                  1252
1  Corporate Auto      2  number_of_open_complaints                  1089
2   Personal Auto      1  number_of_open_complaints                  4329
3   Personal Auto      2  number_of_open_complaints                  3799
4    Special Auto      1  number_of_open_complaints                   237
5    Special Auto      2  number_of_open_complaints                   204